public class DataReconciliation {
    // Проверить, что месячные и годовой отчёты были считаны из файлов. В случае если этого не было сделано, нужно предложить сначала считать данные.
   // Подсчитать суммы доходов и расходов по каждому из месяцев.
   // Сверить полученные суммы с суммой доходов и расходов в отчёте по году.
  //  При обнаружении несоответствия программа должна вывести месяц, где оно обнаружено.
  //  Если несоответствий не обнаружено, приложение должно вывести только информацию об успешном завершении операции.
}
