public class MonthlyReport {
  //  название месяца;
   // самый прибыльный товар, название товара и сумму;
   // самую большую трату, название товара и сумму.
    //        🔥 Перед выполнением подсчётов необходимо проверить, что месячные отчёты были считаны из файла. В случае если этого сделано не было, нужно предложить сначала считать данные.




  //  Информация из годового отчёта.
 //  При вызове этой функции программа должна выводить такие данные:
  //  рассматриваемый год;
  //  прибыль по каждому месяцу;
   // средний расход за все имеющиеся операции в году;
  //  средний доход за все имеющиеся операции в году.
    //        🔥 Перед выполнением подсчётов необходимо проверить, что годовой отчёт был считан из файла. В случае если этого сделано не было, нужно предложить сначала считать данные.


}
